# Insulation Material Get Insulation Material Ids Method

Source: https://www.revitapidocs.com/2026/3a520b37-6db0-c9f2-0f34-a561291ed4ff.htm

---

| Insulation Material Get Insulation Material Ids Method |
| --- |

Gets all the Conductor Insulation Material ids in the given document, sorted by name.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static IList<ElementId> GetInsulationMaterialIds(
	Document document
)
```

```
Public Shared Function GetInsulationMaterialIds (
	document As Document
) As IList(Of ElementId)
```

```
public:
static IList<ElementId^>^ GetInsulationMaterialIds(
	Document^ document
)
```

```
static member GetInsulationMaterialIds :
        document : Document -> IList<ElementId>
```

#### Parameters

document Document
:   The document.

#### Return Value

IList ElementId
All the Conductor Insulation Material ids in this document. Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The document is in failure mode: an operation has failed,  and Revit requires the user to either cancel the operation  or fix the problem (usually by deleting certain elements). |

See Also

#### Reference

InsulationMaterial Class Autodesk.Revit.DB.Electrical Namespace